using System;

namespace Шаблони
{
    public class Program
    {
        static void Main(string[] args)
        { 
            List<Post> posts = new List<Post>();
            WebPage page = new WebPage(); 
            page.addPost(posts,"16-02-2005", "За атаками на “Вагнер” у Судані стоять українські спецслужби — CNN", "Українські спецслужби стоять за ударами безпілотників і наземною операцією, спрямованою проти підтримуваного Вагнером ополчення Судану.\r\n\r\nПро це повідомляє видання CNN опираючись на результати власного розслідування.\r\n\r\nВидання посилається на розмову з українським військовим джерелом, котре описало операцію як роботу «не суданських військових». На питання про те, чи стоїть Україна за атаками, джерело лише зазначило, що «відповідальність, ймовірно, покладена на українські спецслужби».\r\n\r\nЯк повідомляють журналісти, операція включала наземну компоненту та серію атак дронів на воєнізоване угруповання Сил швидкої підтримки (RSF), котре користується підтримкою російських найманців “Вагнер” в ході боротьби проти суданської армії за контроль над країною.", "https://mil.in.ua/wp-content/uploads/2023/09/644cc3bf465a7-munition-einer-panzerhaubitze-300x184.webp", "SSO");
            page.addPost(posts,"17-03-2006", "Міни, бронемашини та снаряди: новий пакет допомоги від Німеччини", "Уряд Німеччини розкрив деталі нового пакету військової допомоги Україні вартістю 400 мільйонів євро.\r\n\r\nВідповідне повідомлення з’явилося на сайті німецького уряду.\r\n\r\nНагадаємо, що 18 вересня новий пакет допомоги анонсував міністр оборони Німеччини Борис Пісторіус.", "https://mil.in.ua/wp-content/uploads/2023/09/644cc3bf465a7-munition-einer-panzerhaubitze.webp", "Germany_help");
            page.ShowPageStructure(posts,"Новини 2023",true,"Олександр Галь","0663928283");
            page.WriteFile();
        }
    }
}
