//Варіант 5. Створити таблицю бази даних про співробітників, що мають компютер: прізвище, номер
//кімнати, назва відділу, дані про компютери.

//Cтворити наступні види SQL-запитів:
//a) простий запит на вибірку;
//b) запит на вибірку з використанням спеціальних функцій: LIKE, IS NULL, IN, BETWEEN;
//c) запит зі складним критерієм;
//d) запит з унікальними значеннями;
//e) запит з використанням обчислювального поля;
//f) запит з групуванням по заданому полю, використовуючи умову групування;
//g) запит із сортування по заданому полю в порядку зростання та спадання значень;
//h) запит з використанням дій по модифікації записів.